{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "#Time stamp:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "#Prompt_user:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "#Answer:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "#Time stamp:": 3,
      "#Prompt_user:": 4,
      "#Answer:": 5,
      "!": 6,
      "\"": 7,
      "#": 8,
      "$": 9,
      "%": 10,
      "&": 11,
      "'": 12,
      "(": 13,
      ")": 14,
      "*": 15,
      "+": 16,
      ",": 17,
      "-": 18,
      ".": 19,
      "/": 20,
      "0": 21,
      "1": 22,
      "2": 23,
      "3": 24,
      "4": 25,
      "5": 26,
      "6": 27,
      "7": 28,
      "8": 29,
      "9": 30,
      ":": 31,
      ";": 32,
      "<": 33,
      "=": 34,
      ">": 35,
      "?": 36,
      "@": 37,
      "A": 38,
      "B": 39,
      "C": 40,
      "D": 41,
      "E": 42,
      "F": 43,
      "G": 44,
      "H": 45,
      "I": 46,
      "J": 47,
      "K": 48,
      "L": 49,
      "M": 50,
      "N": 51,
      "O": 52,
      "P": 53,
      "Q": 54,
      "R": 55,
      "S": 56,
      "T": 57,
      "U": 58,
      "V": 59,
      "W": 60,
      "X": 61,
      "Y": 62,
      "Z": 63,
      "[": 64,
      "\\": 65,
      "]": 66,
      "^": 67,
      "_": 68,
      "`": 69,
      "a": 70,
      "b": 71,
      "c": 72,
      "d": 73,
      "e": 74,
      "f": 75,
      "g": 76,
      "h": 77,
      "i": 78,
      "j": 79,
      "k": 80,
      "l": 81,
      "m": 82,
      "n": 83,
      "o": 84,
      "p": 85,
      "q": 86,
      "r": 87,
      "s": 88,
      "t": 89,
      "u": 90,
      "v": 91,
      "w": 92,
      "x": 93,
      "y": 94,
      "z": 95,
      "{": 96,
      "|": 97,
      "}": 98,
      "~": 99,
      "┬б": 100,
      "┬в": 101,
      "┬г": 102,
      "┬д": 103,
      "┬е": 104,
      "┬ж": 105,
      "┬з": 106,
      "┬и": 107,
      "┬й": 108,
      "┬к": 109,
      "┬л": 110,
      "┬м": 111,
      "┬о": 112,
      "┬п": 113,
      "┬░": 114,
      "┬▒": 115,
      "┬▓": 116,
      "┬│": 117,
      "┬┤": 118,
      "┬╡": 119,
      "┬╢": 120,
      "┬╖": 121,
      "┬╕": 122,
      "┬╣": 123,
      "┬║": 124,
      "┬╗": 125,
      "┬╝": 126,
      "┬╜": 127,
      "┬╛": 128,
      "┬┐": 129,
      "├А": 130,
      "├Б": 131,
      "├В": 132,
      "├Г": 133,
      "├Д": 134,
      "├Е": 135,
      "├Ж": 136,
      "├З": 137,
      "├И": 138,
      "├Й": 139,
      "├К": 140,
      "├Л": 141,
      "├М": 142,
      "├Н": 143,
      "├О": 144,
      "├П": 145,
      "├Р": 146,
      "├С": 147,
      "├Т": 148,
      "├У": 149,
      "├Ф": 150,
      "├Х": 151,
      "├Ц": 152,
      "├Ч": 153,
      "├Ш": 154,
      "├Щ": 155,
      "├Ъ": 156,
      "├Ы": 157,
      "├Ь": 158,
      "├Э": 159,
      "├Ю": 160,
      "├Я": 161,
      "├а": 162,
      "├б": 163,
      "├в": 164,
      "├г": 165,
      "├д": 166,
      "├е": 167,
      "├ж": 168,
      "├з": 169,
      "├и": 170,
      "├й": 171,
      "├к": 172,
      "├л": 173,
      "├м": 174,
      "├н": 175,
      "├о": 176,
      "├п": 177,
      "├░": 178,
      "├▒": 179,
      "├▓": 180,
      "├│": 181,
      "├┤": 182,
      "├╡": 183,
      "├╢": 184,
      "├╖": 185,
      "├╕": 186,
      "├╣": 187,
      "├║": 188,
      "├╗": 189,
      "├╝": 190,
      "├╜": 191,
      "├╛": 192,
      "├┐": 193,
      "─А": 194,
      "─Б": 195,
      "─В": 196,
      "─Г": 197,
      "─Д": 198,
      "─Е": 199,
      "─Ж": 200,
      "─З": 201,
      "─И": 202,
      "─Й": 203,
      "─К": 204,
      "─Л": 205,
      "─М": 206,
      "─Н": 207,
      "─О": 208,
      "─П": 209,
      "─Р": 210,
      "─С": 211,
      "─Т": 212,
      "─У": 213,
      "─Ф": 214,
      "─Х": 215,
      "─Ц": 216,
      "─Ч": 217,
      "─Ш": 218,
      "─Щ": 219,
      "─Ъ": 220,
      "─Ы": 221,
      "─Ь": 222,
      "─Э": 223,
      "─Ю": 224,
      "─Я": 225,
      "─а": 226,
      "─б": 227,
      "─в": 228,
      "─г": 229,
      "─д": 230,
      "─е": 231,
      "─ж": 232,
      "─з": 233,
      "─и": 234,
      "─й": 235,
      "─к": 236,
      "─л": 237,
      "─м": 238,
      "─н": 239,
      "─о": 240,
      "─п": 241,
      "─░": 242,
      "─▒": 243,
      "─▓": 244,
      "─│": 245,
      "─┤": 246,
      "─╡": 247,
      "─╢": 248,
      "─╖": 249,
      "─╕": 250,
      "─╣": 251,
      "─║": 252,
      "─╗": 253,
      "─╝": 254,
      "─╜": 255,
      "─╛": 256,
      "─┐": 257,
      "┼А": 258,
      "┼Б": 259,
      "┼В": 260,
      "┼Г": 261,
      "─Н─К": 262,
      "=?": 263,
      "12": 264,
      "13": 265,
      "15": 266,
      "11": 267,
      "16": 268,
      "10": 269,
      "17": 270,
      "14": 271,
      "18": 272,
      "19": 273,
      "20": 274,
      "21": 275,
      "22": 276,
      "23": 277,
      "24": 278,
      "25": 279,
      "26": 280,
      "27": 281
    },
    "merges": [
      [
        "─Н",
        "─К"
      ],
      [
        "=",
        "?"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "3"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "7"
      ],
      [
        "1",
        "4"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "3"
      ],
      [
        "2",
        "4"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "7"
      ]
    ]
  }
}