{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "#Time stamp:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "#Prompt_user:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "#Answer:",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "#Time stamp:": 3,
      "#Prompt_user:": 4,
      "#Answer:": 5,
      "!": 6,
      "\"": 7,
      "#": 8,
      "$": 9,
      "%": 10,
      "&": 11,
      "'": 12,
      "(": 13,
      ")": 14,
      "*": 15,
      "+": 16,
      ",": 17,
      "-": 18,
      ".": 19,
      "/": 20,
      "0": 21,
      "1": 22,
      "2": 23,
      "3": 24,
      "4": 25,
      "5": 26,
      "6": 27,
      "7": 28,
      "8": 29,
      "9": 30,
      ":": 31,
      ";": 32,
      "<": 33,
      "=": 34,
      ">": 35,
      "?": 36,
      "@": 37,
      "A": 38,
      "B": 39,
      "C": 40,
      "D": 41,
      "E": 42,
      "F": 43,
      "G": 44,
      "H": 45,
      "I": 46,
      "J": 47,
      "K": 48,
      "L": 49,
      "M": 50,
      "N": 51,
      "O": 52,
      "P": 53,
      "Q": 54,
      "R": 55,
      "S": 56,
      "T": 57,
      "U": 58,
      "V": 59,
      "W": 60,
      "X": 61,
      "Y": 62,
      "Z": 63,
      "[": 64,
      "\\": 65,
      "]": 66,
      "^": 67,
      "_": 68,
      "`": 69,
      "a": 70,
      "b": 71,
      "c": 72,
      "d": 73,
      "e": 74,
      "f": 75,
      "g": 76,
      "h": 77,
      "i": 78,
      "j": 79,
      "k": 80,
      "l": 81,
      "m": 82,
      "n": 83,
      "o": 84,
      "p": 85,
      "q": 86,
      "r": 87,
      "s": 88,
      "t": 89,
      "u": 90,
      "v": 91,
      "w": 92,
      "x": 93,
      "y": 94,
      "z": 95,
      "{": 96,
      "|": 97,
      "}": 98,
      "~": 99,
      "隆": 100,
      "垄": 101,
      "拢": 102,
      "陇": 103,
      "楼": 104,
      "娄": 105,
      "搂": 106,
      "篓": 107,
      "漏": 108,
      "陋": 109,
      "芦": 110,
      "卢": 111,
      "庐": 112,
      "炉": 113,
      "掳": 114,
      "卤": 115,
      "虏": 116,
      "鲁": 117,
      "麓": 118,
      "碌": 119,
      "露": 120,
      "路": 121,
      "赂": 122,
      "鹿": 123,
      "潞": 124,
      "禄": 125,
      "录": 126,
      "陆": 127,
      "戮": 128,
      "驴": 129,
      "脌": 130,
      "脕": 131,
      "脗": 132,
      "脙": 133,
      "脛": 134,
      "脜": 135,
      "脝": 136,
      "脟": 137,
      "脠": 138,
      "脡": 139,
      "脢": 140,
      "脣": 141,
      "脤": 142,
      "脥": 143,
      "脦": 144,
      "脧": 145,
      "脨": 146,
      "脩": 147,
      "脪": 148,
      "脫": 149,
      "脭": 150,
      "脮": 151,
      "脰": 152,
      "脳": 153,
      "脴": 154,
      "脵": 155,
      "脷": 156,
      "脹": 157,
      "脺": 158,
      "脻": 159,
      "脼": 160,
      "脽": 161,
      "脿": 162,
      "谩": 163,
      "芒": 164,
      "茫": 165,
      "盲": 166,
      "氓": 167,
      "忙": 168,
      "莽": 169,
      "猫": 170,
      "茅": 171,
      "锚": 172,
      "毛": 173,
      "矛": 174,
      "铆": 175,
      "卯": 176,
      "茂": 177,
      "冒": 178,
      "帽": 179,
      "貌": 180,
      "贸": 181,
      "么": 182,
      "玫": 183,
      "枚": 184,
      "梅": 185,
      "酶": 186,
      "霉": 187,
      "煤": 188,
      "没": 189,
      "眉": 190,
      "媒": 191,
      "镁": 192,
      "每": 193,
      "膧": 194,
      "膩": 195,
      "膫": 196,
      "膬": 197,
      "膭": 198,
      "膮": 199,
      "膯": 200,
      "膰": 201,
      "膱": 202,
      "膲": 203,
      "膴": 204,
      "膵": 205,
      "膶": 206,
      "膷": 207,
      "膸": 208,
      "膹": 209,
      "膼": 210,
      "膽": 211,
      "膾": 212,
      "膿": 213,
      "臄": 214,
      "臅": 215,
      "臇": 216,
      "臈": 217,
      "臉": 218,
      "臋": 219,
      "臍": 220,
      "臎": 221,
      "臏": 222,
      "臐": 223,
      "臑": 224,
      "臒": 225,
      "臓": 226,
      "摹": 227,
      "蘑": 228,
      "模": 229,
      "膜": 230,
      "磨": 231,
      "摩": 232,
      "魔": 233,
      "抹": 234,
      "末": 235,
      "莫": 236,
      "墨": 237,
      "默": 238,
      "沫": 239,
      "漠": 240,
      "寞": 241,
      "陌": 242,
      "谋": 243,
      "牟": 244,
      "某": 245,
      "拇": 246,
      "牡": 247,
      "亩": 248,
      "姆": 249,
      "母": 250,
      "墓": 251,
      "暮": 252,
      "幕": 253,
      "募": 254,
      "慕": 255,
      "木": 256,
      "目": 257,
      "艀": 258,
      "艁": 259,
      "艂": 260,
      "艃": 261,
      "膷膴": 262,
      "臓x": 263,
      "谩禄": 264,
      "ep": 265,
      "st": 266,
      "step": 267,
      "谩潞": 268,
      "脝掳": 269,
      "臓t": 270,
      "脛某": 271,
      "臓脛某": 272,
      "00": 273,
      "eq": 274,
      "ph": 275,
      "拢c": 276,
      "臓ph": 277,
      "谩禄拢c": 278,
      "脝掳谩禄拢c": 279,
      "臓ta": 280,
      "臓脛某脝掳谩禄拢c": 281,
      "臓v": 282,
      "an": 283,
      "臓1": 284,
      "拢i": 285,
      "谩潞驴": 286,
      "谩潞拢i": 287,
      "臓v谩潞驴": 288,
      "hi": 289,
      "ng": 290,
      "ans": 291,
      "nh": 292,
      "脙艂": 293,
      "臓s": 294,
      "臓ph谩潞拢i": 295,
      "000": 296,
      "12": 297,
      "10": 298,
      "11": 299,
      "臓5": 300,
      "13": 301,
      "臓6": 302,
      "18": 303,
      "15": 304,
      "Chi": 305,
      "Gi": 306,
      "R脙": 307,
      "V谩潞": 308,
      "ai": 309,
      "ch": 310,
      "g谩禄": 311,
      "hai": 312,
      "l脙艂": 313,
      "r脙": 314,
      "隆ng": 315,
      "垄n": 316,
      "卢nh": 317,
      "潞t": 318,
      "脙垄n": 319,
      "脝隆ng": 320,
      "臓ng": 321,
      "臓ch": 322,
      "臓g谩禄": 323,
      "臓hai": 324,
      "臓l脙艂": 325,
      "末m": 326,
      "寞n": 327,
      "艃y": 328,
      "谩禄某": 329,
      "谩禄末m": 330,
      "脝掳脝隆ng": 331,
      "臓tr脙": 332,
      "臓ph脙垄n": 333,
      "臓ph脝掳脝隆ng": 334,
      "hi谩禄末m": 335,
      "臓s谩禄某": 336,
      "Chia": 337,
      "Gi谩潞拢i": 338,
      "R脙潞t": 339,
      "V谩潞艃y": 340,
      "臓nghi谩禄末m": 341,
      "臓cho": 342,
      "臓g谩禄寞n": 343,
      "臓tr脙卢nh": 344,
      "臓9": 345,
      "20": 346,
      "14": 347,
      "臓11": 348,
      "Ch": 349,
      "T脙": 350,
      "d谩潞": 351,
      "uy": 352,
      "楼u": 353,
      "臓d谩潞": 354,
      "磨n": 355,
      "姆i": 356,
      "艃nh": 357,
      "谩禄磨n": 358,
      "谩禄姆i": 359,
      "臓脛某谩禄姆i": 360,
      "臓v脙艂": 361,
      "ang": 362,
      "臓sang": 363,
      "Chuy": 364,
      "T脙艃nh": 365,
      "臓d谩潞楼u": 366,
      "Chuy谩禄磨n": 367,
      "16": 368,
      "臓10": 369,
      "17": 370,
      "臓3": 371,
      "臓12": 372,
      "19": 373,
      "臓2": 374,
      "臓8": 375,
      "臓4": 376,
      "臓7": 377,
      "24": 378,
      "30": 379,
      "28": 380,
      "29": 381,
      "臓-": 382,
      "26": 383,
      "23": 384,
      "27": 385,
      "25": 386,
      "21": 387,
      "22": 388,
      "36": 389,
      "0004": 390,
      "0005": 391,
      "0006": 392,
      "0007": 393,
      "0008": 394,
      "0009": 395,
      "0000": 396,
      "60": 397,
      "120": 398,
      "72": 399,
      "0003": 400,
      "42": 401,
      "33": 402,
      "45": 403,
      "48": 404,
      "40": 405,
      "84": 406,
      "63": 407,
      "140": 408,
      "52": 409,
      "56": 410,
      "135": 411,
      "35": 412,
      "55": 413,
      "90": 414,
      "99": 415,
      "180": 416,
      "68": 417,
      "108": 418,
      "96": 419,
      "32": 420,
      "54": 421,
      "70": 422,
      "80": 423,
      "44": 424,
      "64": 425,
      "46": 426,
      "51": 427,
      "75": 428,
      "76": 429,
      "128": 430,
      "58": 431,
      "112": 432,
      "189": 433,
      "168": 434,
      "34": 435,
      "39": 436,
      "57": 437,
      "71": 438,
      "77": 439,
      "95": 440,
      "126": 441,
      "104": 442,
      "136": 443,
      "240": 444,
      "81": 445,
      "100": 446,
      "144": 447,
      "50": 448,
      "196": 449,
      "47": 450,
      "88": 451,
      "110": 452,
      "210": 453,
      "62": 454,
      "138": 455,
      "150": 456,
      "31": 457,
      "216": 458,
      "125": 459,
      "102": 460,
      "116": 461,
      "132": 462,
      "187": 463,
      "145": 464,
      "171": 465,
      "176": 466,
      "41": 467,
      "49": 468,
      "220": 469,
      "66": 470,
      "121": 471,
      "130": 472,
      "174": 473,
      "192": 474,
      "73": 475,
      "85": 476,
      "65": 477,
      "105": 478,
      "118": 479,
      "133": 480,
      "203": 481,
      "270": 482,
      "312": 483,
      "78": 484,
      "91": 485,
      "92": 486,
      "200": 487,
      "69": 488,
      "101": 489,
      "117": 490,
      "119": 491,
      "158": 492,
      "290": 493,
      "37": 494,
      "38": 495,
      "93": 496,
      "115": 497,
      "153": 498,
      "143": 499,
      "162": 500,
      "43": 501,
      "59": 502,
      "74": 503,
      "79": 504,
      "87": 505,
      "89": 506,
      "61": 507,
      "181": 508,
      "184": 509,
      "201": 510,
      "204": 511
    },
    "merges": [
      [
        "膷",
        "膴"
      ],
      [
        "臓",
        "x"
      ],
      [
        "谩",
        "禄"
      ],
      [
        "e",
        "p"
      ],
      [
        "s",
        "t"
      ],
      [
        "st",
        "ep"
      ],
      [
        "谩",
        "潞"
      ],
      [
        "脝",
        "掳"
      ],
      [
        "臓",
        "t"
      ],
      [
        "脛",
        "某"
      ],
      [
        "臓",
        "脛某"
      ],
      [
        "0",
        "0"
      ],
      [
        "e",
        "q"
      ],
      [
        "p",
        "h"
      ],
      [
        "拢",
        "c"
      ],
      [
        "臓",
        "ph"
      ],
      [
        "谩禄",
        "拢c"
      ],
      [
        "脝掳",
        "谩禄拢c"
      ],
      [
        "臓t",
        "a"
      ],
      [
        "臓脛某",
        "脝掳谩禄拢c"
      ],
      [
        "臓",
        "v"
      ],
      [
        "a",
        "n"
      ],
      [
        "臓",
        "1"
      ],
      [
        "拢",
        "i"
      ],
      [
        "谩潞",
        "驴"
      ],
      [
        "谩潞",
        "拢i"
      ],
      [
        "臓v",
        "谩潞驴"
      ],
      [
        "h",
        "i"
      ],
      [
        "n",
        "g"
      ],
      [
        "an",
        "s"
      ],
      [
        "n",
        "h"
      ],
      [
        "脙",
        "艂"
      ],
      [
        "臓",
        "s"
      ],
      [
        "臓ph",
        "谩潞拢i"
      ],
      [
        "00",
        "0"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "臓",
        "5"
      ],
      [
        "1",
        "3"
      ],
      [
        "臓",
        "6"
      ],
      [
        "1",
        "8"
      ],
      [
        "1",
        "5"
      ],
      [
        "C",
        "hi"
      ],
      [
        "G",
        "i"
      ],
      [
        "R",
        "脙"
      ],
      [
        "V",
        "谩潞"
      ],
      [
        "a",
        "i"
      ],
      [
        "c",
        "h"
      ],
      [
        "g",
        "谩禄"
      ],
      [
        "h",
        "ai"
      ],
      [
        "l",
        "脙艂"
      ],
      [
        "r",
        "脙"
      ],
      [
        "隆",
        "ng"
      ],
      [
        "垄",
        "n"
      ],
      [
        "卢",
        "nh"
      ],
      [
        "潞",
        "t"
      ],
      [
        "脙",
        "垄n"
      ],
      [
        "脝",
        "隆ng"
      ],
      [
        "臓",
        "ng"
      ],
      [
        "臓",
        "ch"
      ],
      [
        "臓",
        "g谩禄"
      ],
      [
        "臓",
        "hai"
      ],
      [
        "臓",
        "l脙艂"
      ],
      [
        "末",
        "m"
      ],
      [
        "寞",
        "n"
      ],
      [
        "艃",
        "y"
      ],
      [
        "谩禄",
        "某"
      ],
      [
        "谩禄",
        "末m"
      ],
      [
        "脝掳",
        "脝隆ng"
      ],
      [
        "臓t",
        "r脙"
      ],
      [
        "臓ph",
        "脙垄n"
      ],
      [
        "臓ph",
        "脝掳脝隆ng"
      ],
      [
        "hi",
        "谩禄末m"
      ],
      [
        "臓s",
        "谩禄某"
      ],
      [
        "Chi",
        "a"
      ],
      [
        "Gi",
        "谩潞拢i"
      ],
      [
        "R脙",
        "潞t"
      ],
      [
        "V谩潞",
        "艃y"
      ],
      [
        "臓ng",
        "hi谩禄末m"
      ],
      [
        "臓ch",
        "o"
      ],
      [
        "臓g谩禄",
        "寞n"
      ],
      [
        "臓tr脙",
        "卢nh"
      ],
      [
        "臓",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "1",
        "4"
      ],
      [
        "臓1",
        "1"
      ],
      [
        "C",
        "h"
      ],
      [
        "T",
        "脙"
      ],
      [
        "d",
        "谩潞"
      ],
      [
        "u",
        "y"
      ],
      [
        "楼",
        "u"
      ],
      [
        "臓",
        "d谩潞"
      ],
      [
        "磨",
        "n"
      ],
      [
        "姆",
        "i"
      ],
      [
        "艃",
        "nh"
      ],
      [
        "谩禄",
        "磨n"
      ],
      [
        "谩禄",
        "姆i"
      ],
      [
        "臓脛某",
        "谩禄姆i"
      ],
      [
        "臓v",
        "脙艂"
      ],
      [
        "an",
        "g"
      ],
      [
        "臓s",
        "ang"
      ],
      [
        "Ch",
        "uy"
      ],
      [
        "T脙",
        "艃nh"
      ],
      [
        "臓d谩潞",
        "楼u"
      ],
      [
        "Chuy",
        "谩禄磨n"
      ],
      [
        "1",
        "6"
      ],
      [
        "臓1",
        "0"
      ],
      [
        "1",
        "7"
      ],
      [
        "臓",
        "3"
      ],
      [
        "臓1",
        "2"
      ],
      [
        "1",
        "9"
      ],
      [
        "臓",
        "2"
      ],
      [
        "臓",
        "8"
      ],
      [
        "臓",
        "4"
      ],
      [
        "臓",
        "7"
      ],
      [
        "2",
        "4"
      ],
      [
        "3",
        "0"
      ],
      [
        "2",
        "8"
      ],
      [
        "2",
        "9"
      ],
      [
        "臓",
        "-"
      ],
      [
        "2",
        "6"
      ],
      [
        "2",
        "3"
      ],
      [
        "2",
        "7"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "3",
        "6"
      ],
      [
        "000",
        "4"
      ],
      [
        "000",
        "5"
      ],
      [
        "000",
        "6"
      ],
      [
        "000",
        "7"
      ],
      [
        "000",
        "8"
      ],
      [
        "000",
        "9"
      ],
      [
        "00",
        "00"
      ],
      [
        "6",
        "0"
      ],
      [
        "12",
        "0"
      ],
      [
        "7",
        "2"
      ],
      [
        "000",
        "3"
      ],
      [
        "4",
        "2"
      ],
      [
        "3",
        "3"
      ],
      [
        "4",
        "5"
      ],
      [
        "4",
        "8"
      ],
      [
        "4",
        "0"
      ],
      [
        "8",
        "4"
      ],
      [
        "6",
        "3"
      ],
      [
        "14",
        "0"
      ],
      [
        "5",
        "2"
      ],
      [
        "5",
        "6"
      ],
      [
        "13",
        "5"
      ],
      [
        "3",
        "5"
      ],
      [
        "5",
        "5"
      ],
      [
        "9",
        "0"
      ],
      [
        "9",
        "9"
      ],
      [
        "18",
        "0"
      ],
      [
        "6",
        "8"
      ],
      [
        "10",
        "8"
      ],
      [
        "9",
        "6"
      ],
      [
        "3",
        "2"
      ],
      [
        "5",
        "4"
      ],
      [
        "7",
        "0"
      ],
      [
        "8",
        "0"
      ],
      [
        "4",
        "4"
      ],
      [
        "6",
        "4"
      ],
      [
        "4",
        "6"
      ],
      [
        "5",
        "1"
      ],
      [
        "7",
        "5"
      ],
      [
        "7",
        "6"
      ],
      [
        "12",
        "8"
      ],
      [
        "5",
        "8"
      ],
      [
        "1",
        "12"
      ],
      [
        "18",
        "9"
      ],
      [
        "16",
        "8"
      ],
      [
        "3",
        "4"
      ],
      [
        "3",
        "9"
      ],
      [
        "5",
        "7"
      ],
      [
        "7",
        "1"
      ],
      [
        "7",
        "7"
      ],
      [
        "9",
        "5"
      ],
      [
        "12",
        "6"
      ],
      [
        "10",
        "4"
      ],
      [
        "13",
        "6"
      ],
      [
        "24",
        "0"
      ],
      [
        "8",
        "1"
      ],
      [
        "1",
        "00"
      ],
      [
        "14",
        "4"
      ],
      [
        "5",
        "0"
      ],
      [
        "19",
        "6"
      ],
      [
        "4",
        "7"
      ],
      [
        "8",
        "8"
      ],
      [
        "1",
        "10"
      ],
      [
        "2",
        "10"
      ],
      [
        "6",
        "2"
      ],
      [
        "13",
        "8"
      ],
      [
        "15",
        "0"
      ],
      [
        "3",
        "1"
      ],
      [
        "2",
        "16"
      ],
      [
        "12",
        "5"
      ],
      [
        "10",
        "2"
      ],
      [
        "11",
        "6"
      ],
      [
        "13",
        "2"
      ],
      [
        "18",
        "7"
      ],
      [
        "14",
        "5"
      ],
      [
        "17",
        "1"
      ],
      [
        "17",
        "6"
      ],
      [
        "4",
        "1"
      ],
      [
        "4",
        "9"
      ],
      [
        "2",
        "20"
      ],
      [
        "6",
        "6"
      ],
      [
        "12",
        "1"
      ],
      [
        "13",
        "0"
      ],
      [
        "17",
        "4"
      ],
      [
        "19",
        "2"
      ],
      [
        "7",
        "3"
      ],
      [
        "8",
        "5"
      ],
      [
        "6",
        "5"
      ],
      [
        "10",
        "5"
      ],
      [
        "11",
        "8"
      ],
      [
        "13",
        "3"
      ],
      [
        "20",
        "3"
      ],
      [
        "27",
        "0"
      ],
      [
        "3",
        "12"
      ],
      [
        "7",
        "8"
      ],
      [
        "9",
        "1"
      ],
      [
        "9",
        "2"
      ],
      [
        "2",
        "00"
      ],
      [
        "6",
        "9"
      ],
      [
        "10",
        "1"
      ],
      [
        "11",
        "7"
      ],
      [
        "11",
        "9"
      ],
      [
        "15",
        "8"
      ],
      [
        "29",
        "0"
      ],
      [
        "3",
        "7"
      ],
      [
        "3",
        "8"
      ],
      [
        "9",
        "3"
      ],
      [
        "11",
        "5"
      ],
      [
        "15",
        "3"
      ],
      [
        "14",
        "3"
      ],
      [
        "16",
        "2"
      ],
      [
        "4",
        "3"
      ],
      [
        "5",
        "9"
      ],
      [
        "7",
        "4"
      ],
      [
        "7",
        "9"
      ],
      [
        "8",
        "7"
      ],
      [
        "8",
        "9"
      ],
      [
        "6",
        "1"
      ],
      [
        "18",
        "1"
      ],
      [
        "18",
        "4"
      ],
      [
        "20",
        "1"
      ],
      [
        "20",
        "4"
      ]
    ]
  }
}